КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы/КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы</name>
  <resources>
    <name>ВремяСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончанияОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыЗадач</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторВоркера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_СценарииАвтоматическойРаботы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснования</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемыИДокументыКонтурЛогистика</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыЗадач/КонтурЛогистика_СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыЗадач</name>
  <enumValues>
    <name>ВОчереди</name>
  </enumValues>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавить задачу в очередь
//
// Параметры:
//  Сценарий			 - СправочникСсылка.КонтурЛогистика_СценарииАвтоматическойРаботы				 - Сценарий
//  ДокументОснования	 - КонтурЛогистика_ОбщаяКомандаДокументыУчетнойСистемыИДокументыКонтурЛогистика	 - Документ основание для задачи
//  Контекст			 - Структура																	 - Данные для выполнения задачи
//
Процедура ДобавитьВОчередь(Сценарий, ДокументОснования, Контекст) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сценарий.Установить(Сценарий);
	НаборЗаписей.Отбор.ДокументОснования.Установить(ДокументОснования);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() <> 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Сценарий = Сценарий;
	НоваяЗапись.ДокументОснования = ДокументОснования;
	
	НоваяЗапись.ВремяСоздания = ТекущаяДатаСеанса();
	НоваяЗапись.Статус = Перечисления.КонтурЛогистика_СтатусыЗадач.ВОчереди;
	
	НоваяЗапись.Контекст = Новый ХранилищеЗначения(Контекст);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Назначает задачу конкретному вокеру
//
// Параметры:
//  Сценарий			 - СправочникСсылка.КонтурЛогистика_СценарииАвтоматическойРаботы				 - Сценарий
//  ДокументОснования	 - КонтурЛогистика_ОбщаяКомандаДокументыУчетнойСистемыИДокументыКонтурЛогистика	 - Документ основание для задачи
//  ИдентификаторВоркера - Строка																		 - Идентификатор воркера
//
Процедура ДатьЗадачуВокеру(Сценарий, ДокументОснования, ИдентификаторВоркера) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сценарий.Установить(Сценарий);
	НаборЗаписей.Отбор.ДокументОснования.Установить(ДокументОснования);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяЗапись = НаборЗаписей[0];
	ТекущаяЗапись.Статус = Перечисления.КонтурЛогистика_СтатусыЗадач.ВОбработке;
	ТекущаяЗапись.ИдентификаторВоркера = ИдентификаторВоркера;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Установливаем успешный результат выполнения задачи
//
// Параметры:
//  Сценарий				 - СправочникСсылка.КонтурЛогистика_СценарииАвтоматическойРаботы				 - Сценарий
//  ДокументОснования		 - КонтурЛогистика_ОбщаяКомандаДокументыУчетнойСистемыИДокументыКонтурЛогистика	 - Документ основание для задачи
//  ВремяНачалаОбработки	 - Дата																			 - Время начала обработки
//
Процедура УстановитьНачалоНадЗадачей(Сценарий, ДокументОснования, ВремяНачалаОбработки) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сценарий.Установить(Сценарий);
	НаборЗаписей.Отбор.ДокументОснования.Установить(ДокументОснования);
	НаборЗаписей.Прочитать();
	
	Для Каждого ТекущаяСтрока Из НаборЗаписей Цикл
		ТекущаяСтрока.ВремяНачалаОбработки = ВремяНачалаОбработки;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Установливаем успешный результат выполнения задачи
//
// Параметры:
//  Сценарий				 - СправочникСсылка.КонтурЛогистика_СценарииАвтоматическойРаботы				 - Сценарий
//  ДокументОснования		 - КонтурЛогистика_ОбщаяКомандаДокументыУчетнойСистемыИДокументыКонтурЛогистика	 - Документ основание для задачи
//  ВремяОкончанияОбработки	 - Дата																			 - Время окончания обработки
//
Процедура УстановитьУспех(Сценарий, ДокументОснования, ВремяОкончанияОбработки) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сценарий.Установить(Сценарий);
	НаборЗаписей.Отбор.ДокументОснования.Установить(ДокументОснования);
	НаборЗаписей.Прочитать();
	
	Для Каждого ТекущаяСтрока Из НаборЗаписей Цикл
		ТекущаяСтрока.ВремяОкончанияОбработки = ВремяОкончанияОбработки;
		ТекущаяСтрока.Статус = Перечисления.КонтурЛогистика_СтатусыЗадач.Выполнена;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Устанавливает ошибку
//
// Параметры:
//  Сценарий				 - СправочникСсылка.КонтурЛогистика_СценарииАвтоматическойРаботы				 - Сценарий
//  ДокументОснования		 - КонтурЛогистика_ОбщаяКомандаДокументыУчетнойСистемыИДокументыКонтурЛогистика	 - Документ основание для задачи
//  ТекстОшибки				 - Строка	 - Текст ошибки
//
Процедура УстановитьОшибку(Сценарий, ДокументОснования, ТекстОшибки) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сценарий.Установить(Сценарий);
	НаборЗаписей.Отбор.ДокументОснования.Установить(ДокументОснования);
	НаборЗаписей.Прочитать();
	
	Для Каждого ТекущаяСтрока Из НаборЗаписей Цикл
		ТекущаяСтрока.Статус = Перечисления.КонтурЛогистика_СтатусыЗадач.Ошибка;
		ТекущаяСтрока.ТекстОшибки = ТекстОшибки;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Возвращаем задачу в очередь обработки
//
// Параметры:
//  Сценарий				 - СправочникСсылка.КонтурЛогистика_СценарииАвтоматическойРаботы				 - Сценарий
//  ДокументОснования		 - КонтурЛогистика_ОбщаяКомандаДокументыУчетнойСистемыИДокументыКонтурЛогистика	 - Документ основание для задачи
//
Процедура ВернутьЗадачуВОчередьОбработки(Сценарий, ДокументОснования) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сценарий.Установить(Сценарий);
	НаборЗаписей.Отбор.ДокументОснования.Установить(ДокументОснования);
	НаборЗаписей.Прочитать();
	
	Для Каждого ТекущаяСтрока Из НаборЗаписей Цикл
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ВремяНачалаОбработки) Тогда
			
			// Значит задача была взята в работу вокером, но не завершилось в срок
			// Увеличим количество попыток
			ТекущаяСтрока.КоличествоПопыток = ТекущаяСтрока.КоличествоПопыток + 1;
			
		КонецЕсли;
		
		Если ТекущаяСтрока.КоличествоПопыток > 2 Тогда
			
			// За три попытки не удалось обработать задачу
			ТекущаяСтрока.Статус = Перечисления.КонтурЛогистика_СтатусыЗадач.Ошибка;
			ТекущаяСтрока.ТекстОшибки = "Превышено количество попыток выполнения";
			
		Иначе
			
			// Просто вернем в очередь
			ТекущаяСтрока.Статус = Перечисления.КонтурЛогистика_СтатусыЗадач.ВОчереди;
			ТекущаяСтрока.ВремяНачалаОбработки = Неопределено;
			ТекущаяСтрока.ВремяОкончанияОбработки = Неопределено;
			ТекущаяСтрока.ИдентификаторВоркера = "";
			ТекущаяСтрока.ТекстОшибки = "Возвращена в очередь";
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Удаляем старые выполненные задачи
//
Процедура УдалитьСтарыеВыполненныеЗадачи() Экспорт
	
	НеделяВСекундах = 7 * 24 * 60 * 60;
	ВремяОкончанияОбработки = ТекущаяДатаСеанса() - НеделяВСекундах;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВремяОкончанияОбработки", ВремяОкончанияОбработки);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.Сценарий КАК Сценарий,
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ДокументОснования КАК ДокументОснования
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы КАК КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы
	|ГДЕ
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыЗадач.Выполнена)
	|	И КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ВремяОкончанияОбработки < &ВремяОкончанияОбработки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сценарий.Установить(Выборка.Сценарий);
		НаборЗаписей.Отбор.ДокументОснования.Установить(Выборка.ДокументОснования);
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
